Tekla Open API Reference for Tekla Structures 2025
ModificationStamp Constructor
 Creates a new modification stamp instance where the current modification stamp is 0. Can be used for fetching all the created or deleted model objects from the model history.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModificationStamp()
Public Sub New
See Also
Reference
ModificationStamp Class
ModificationStamp Overload
Tekla.Structures.Model.History Namespace